{"text": "caption: a man in a black shirt and a black tie \ngen-z social media caption: how did the kitten get stuck up a treeeeeeee *ฅ^•ﻌ•^ฅ*"}
{"text": "caption: a man is jumping up into the air above a kitchen \ngen-z social media caption: how did the kitten get stuck up a treeeeeeee *ฅ^•ﻌ•^ฅ*"}
{"text": "caption: a woman in a black dress is on a wall \ngen-z social media caption: how did the kitten get stuck up a treeeeeeee *ฅ^•ﻌ•^ฅ*"}
{"text": "caption: a woman walking down a street with a bag \ngen-z social media caption: Born in the USA baby"}
{"text": "caption: a red and white flag and a building \ngen-z social media caption: Born in the USA baby"}
{"text": "caption: a person's shoes are hanging off of a wall \ngen-z social media caption: Born in the USA baby"}
{"text": "caption: a woman walking down the street with a cell phone \ngen-z social media caption: Born in the USA baby"}
{"text": "caption: two men sitting on a bench in a room \ngen-z social media caption: W"}
{"text": "caption: two people sitting on a bus with a remote \ngen-z social media caption: W"}
{"text": "caption: a man sitting on a couch next to a woman \ngen-z social media caption: W"}
{"text": "caption: a man sitting on a bench next to a woman \ngen-z social media caption: W"}
{"text": "caption: a woman in a black dress and black pants \ngen-z social media caption: I only want you….. <NAME>"}
{"text": "caption: a woman in a black dress posing for a picture \ngen-z social media caption: I only want you….. <NAME>"}
{"text": "caption: a woman in a black dress and a black skirt \ngen-z social media caption: I only want you….. <NAME>"}
{"text": "caption: a woman sitting on a couch with a phone \ngen-z social media caption: <NAME> GIVEAWAY 🤩⭐️ Hi babes, we’re giving away the ENTIRE moto collection to you & your bestie. Here’s how to enter: 1. Follow <NAME> 2. Like this post & tag your friend in the comments! Winners will be announced on the Steele IG on Thursday. Good Luck🖤🏁"}
{"text": "caption: a woman in a black dress sitting on a motorcycle \ngen-z social media caption: <NAME> GIVEAWAY 🤩⭐️ Hi babes, we’re giving away the ENTIRE moto collection to you & your bestie. Here’s how to enter: 1. Follow <NAME> 2. Like this post & tag your friend in the comments! Winners will be announced on the Steele IG on Thursday. Good Luck🖤🏁"}
{"text": "caption: a woman laying on a couch with a picture of a man on it \ngen-z social media caption: What an unforgettable night♥️ <NAME>"}
{"text": "caption: a woman in a black dress and a black skirt \ngen-z social media caption: What an unforgettable night♥️ <NAME>"}